СРО_Копия/src/Documents/ОтчетОбОперацияхСДС/ОтчетОбОперацияхСДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОбОперацияхСДС</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КПК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОтчетногоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодОтчетногоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПКПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПККраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПКАдресФактическогоМестонахождения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПКИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПКОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНулевогоУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_КПКИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_КПКОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_КПККПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_КПКПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_КПККраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНаправления</name>
    <type>
      <types>EnumRef.ОснованияНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_НомерПредписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_ДатаПредписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокумента</name>
    <type>
      <types>EnumRef.КодДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВидаОтчетаПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_Примечания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КодыОсновнойДеятельности</name>
    <attributes>
      <name>КодОсновнойДеятельности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыИныхВидовДеятельности</name>
    <attributes>
      <name>КодИныхВидовДеятельности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации</name>
    <attributes>
      <name>РегНомерКредОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИСокращенноеНаименованиеКредОрганизации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Подраздел</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодВидаОперации</name>
      <type>
        <types>CatalogRef.СРО_ВидыОперацийДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСписания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеЛица</name>
    <attributes>
      <name>ВидОтветственногоЛица</name>
      <type>
        <types>EnumRef.СРО_ВидыОтветственныхЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СРО_Копия/src/Documents/ОтчетОбОперацияхСДС/ManagerModule.bsl
Функция ПолучитьТекстЗапроса() Экспорт     
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Ссылка КАК Ссылка,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.НомерСтроки КАК НомерСтроки,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.РегНомерКредОрганизации КАК РегНомерКредОрганизации,
	|	ВЫРАЗИТЬ(ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.ПолноеИСокращенноеНаименованиеКредОрганизации КАК СТРОКА(1000)) КАК ПолноеИСокращенноеНаименованиеКредОрганизации,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Валюта КАК Валюта,
	|	ВЫРАЗИТЬ(ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Подраздел КАК СТРОКА(1000)) КАК Подраздел,
	|	ВЫРАЗИТЬ(ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.ВидОперации КАК СТРОКА(1000)) КАК ВидОперации,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.КодВидаОперации КАК КодВидаОперации,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.СуммаСписания КАК СуммаСписания,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.СуммаЗачисления КАК СуммаЗачисления,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.ПорядокСортировки КАК ПорядокСортировки,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.КодСтраны КАК КодСтраны,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Раздел КАК Раздел,
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Валюта.НаименованиеПолное КАК ВалютаНаименованиеПолное
	|ИЗ
	|	Документ.ОтчетОбОперацияхСДС.ОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации КАК ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации
	|ГДЕ
	|	ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Ссылка = &Ссылка
	|	И ОтчетОбОперацияхСДСОперацииПоБанковскимСчетамНекредитнойФинансовойОрганизации.Раздел = &Раздел
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокСортировки
	|ИТОГИ
	|	МАКСИМУМ(ПолноеИСокращенноеНаименованиеКредОрганизации)
	|ПО
	|	РегНомерКредОрганизации,
	|	Валюта,
	|	Подраздел,
	|	ВидОперации";
	
	Возврат ТекстЗапроса; 		
	
КонецФункции



Функция ВывестиРаздел(ДокСсылка, Раздел = "") Экспорт
	ТабДокумент = Новый ТабличныйДокумент;    
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	Макет = ПолучитьОбщийМакет("СРО_ОтчетДвиженияДС");
	
	ОбластьШапкаРаздела = Макет.ПолучитьОбласть("ШапкаРаздела");                    	
	
	Если Раздел = "Раздел1" Тогда       
		
		
		ОбластьКредитнаяОрганизация = Макет.ПолучитьОбласть("КредитнаяОрганизация");
		ОбластьВалюта= Макет.ПолучитьОбласть("Валюта");
		
		НаименованиеРаздела = "Раздел 1. Операции, совершенные с использованием банковских счетов некредитной финансовой организации";		
		ОбластьШапкаРаздела.Параметры.НаименованиеРаздела = НаименованиеРаздела;		
		ТабДокумент.Вывести(ОбластьШапкаРаздела, 1);     
		
		
		Запрос = Новый Запрос;                                                                                                        		
		Запрос.Текст = ПолучитьТекстЗапроса(); 
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		Запрос.УстановитьПараметр("Раздел", Раздел);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПоКредОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКредОрганизации.Следующий() Цикл 
			
			РегНомерКредОрганизации = ВыборкаПоКредОрганизации.РегНомерКредОрганизации; 
			ПолноеИСокращенноеНаименованиеКредОрганизации = "";
			
			счГруппировок = 1;
			счРегНомерКредОрганизации = 0;
			
			Если РегНомерКредОрганизации <> "" Тогда                                                    						
				ОбластьКредитнаяОрганизация.Параметры.Заполнить(ВыборкаПоКредОрганизации);
				//.РегНомерКредОрганизации = РегНомерКредОрганизации;   			
			
				ТекСч = счГруппировок + 1; 
				
				ТабДокумент.Вывести(ОбластьКредитнаяОрганизация, ТекСч);				
							
			КонецЕсли;    
			
			
			// Выводим по валюте
			ВыборкаВалюта = ВыборкаПоКредОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
			
			Пока ВыборкаВалюта.Следующий() Цикл  
				
				счВалюта = 0;
				Если РегНомерКредОрганизации <> "" Тогда 
					ОбластьВалюта.Параметры.ВалютаНаименованиеПолное = ВыборкаВалюта.Валюта.НаименованиеПолное;   			                   
					
					счВалюта = 1;
					ТабДокумент.Вывести(ОбластьВалюта, ТекСч + счВалюта);						
				КонецЕсли;        	
				
				
				
				ВыборкаПодраздел = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
			
				Пока ВыборкаПодраздел.Следующий() Цикл    
					
					ОбластьВидОперации = Макет.ПолучитьОбласть("ВидОперации");  
					счПодраздел = 1;
					Если Лев(ВыборкаПодраздел.Подраздел, 3) = "1.1" Тогда
						ОбластьПодраздел = Макет.ПолучитьОбласть("ШапкаРаздел1_1");   						
						ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРаздел1_1");     											  
						ОбластьСтрокаИтоги = Макет.ПолучитьОбласть("СтрокаИтоги1_1");    
						
					ИначеЕсли Лев(ВыборкаПодраздел.Подраздел, 3) = "1.2" Тогда
						ОбластьПодраздел = Макет.ПолучитьОбласть("ШапкаРаздел1_2");   
						ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРаздел1_2");     					
					КонецЕсли;
					
					
					ОбластьПодраздел.Параметры.НаименованиеПодраздела = ВыборкаПодраздел.Подраздел;   
					ТабДокумент.Вывести(ОбластьПодраздел, ТекСч + счВалюта + счПодраздел);    
					
					ВыборкаВидОперации = ВыборкаПодраздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);     
					
					
					Пока ВыборкаВидОперации.Следующий() Цикл 	     					
					
						
						Если СтрНайти(ВыборкаВидОперации.ВидОперации, "Всего обороты") > 0 
							 ИЛИ СтрНайти(ВыборкаВидОперации.ВидОперации, "Остатки на начало") > 0
							 ИЛИ СтрНайти(ВыборкаВидОперации.ВидОперации, "Остатки на конец") > 0 Тогда    
							Выборка  = ВыборкаВидОперации.Выбрать();          
							
							Пока Выборка.Следующий() Цикл 
								ОбластьСтрокаИтоги.Параметры.Заполнить(Выборка);  
								ТабДокумент.Вывести(ОбластьСтрокаИтоги, ТекСч + счВалюта + счПодраздел + 1);    		
								
							КонецЦикла;
							
						Иначе	
							ОбластьВидОперации.Параметры.ВидОперации = ВыборкаВидОперации.ВидОперации;    
							ТабДокумент.Вывести(ОбластьВидОперации, ТекСч + счВалюта + счПодраздел + 1); 
							
								
							Выборка  = ВыборкаВидОперации.Выбрать();          
							
							Пока Выборка.Следующий() Цикл 
								ОбластьСтрока.Параметры.Заполнить(Выборка);  
								ТабДокумент.Вывести(ОбластьСтрока, ТекСч + счВалюта + счПодраздел + 2);    		
								
							КонецЦикла;    							
						КонецЕсли;							
							
							
						
						
												
											
					КонецЦикла;	
		 				
					
					
				КонецЦикла;

			
			 КонецЦикла;
			
		КонецЦикла;	
		
		
	ИначеЕсли Раздел = "Раздел2" Тогда   
		НаименованиеРаздела = "Раздел 2. Операции, проведенные через кассу некредитной финансовой организации";		
		ОбластьШапкаРаздела.Параметры.НаименованиеРаздела = НаименованиеРаздела;		
		ТабДокумент.Вывести(ОбластьШапкаРаздела, 1);      
		
		Запрос = Новый Запрос;                                                                                                        		
		Запрос.Текст = ПолучитьТекстЗапроса(); 
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		Запрос.УстановитьПараметр("Раздел", Раздел);  
		
		РезультатЗапроса = Запрос.Выполнить();   
		
		ВыборкаПоКредОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКредОрганизации.Следующий() Цикл   
			
			// Выводим по валюте
			ВыборкаВалюта = ВыборкаПоКредОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
			
			Пока ВыборкаВалюта.Следующий() Цикл  
				
				ВыборкаПодраздел = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
			
				Пока ВыборкаПодраздел.Следующий() Цикл    
					
					ОбластьВидОперации = Макет.ПолучитьОбласть("ВидОперации");  
					счПодраздел = 1;
					Если Лев(ВыборкаПодраздел.Подраздел, 3) = "2.1" Тогда
						ОбластьПодраздел = Макет.ПолучитьОбласть("ШапкаРаздел2_1");   						
						ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРаздел1_1");     											  
						ОбластьСтрокаИтоги = Макет.ПолучитьОбласть("СтрокаИтоги1_1");    
						
					ИначеЕсли Лев(ВыборкаПодраздел.Подраздел, 3) = "1.2" Тогда
						ОбластьПодраздел = Макет.ПолучитьОбласть("ШапкаРаздел2_2");   
						ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРаздел2_2");     					
					КонецЕсли;
					
					
					ОбластьПодраздел.Параметры.НаименованиеПодраздела = ВыборкаПодраздел.Подраздел;   
					ТабДокумент.Вывести(ОбластьПодраздел, 2);    
					
					ВыборкаВидОперации = ВыборкаПодраздел.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);     
					
					
					Пока ВыборкаВидОперации.Следующий() Цикл 	     					
					
						
						Если СтрНайти(ВыборкаВидОперации.ВидОперации, "Всего") > 0 
							 ИЛИ СтрНайти(ВыборкаВидОперации.ВидОперации, "Остатки денежных средств в кассе на начало") > 0
							 ИЛИ СтрНайти(ВыборкаВидОперации.ВидОперации, "Остатки денежных средств в кассе на конец") > 0 Тогда    
							Выборка  = ВыборкаВидОперации.Выбрать();          
							
							Пока Выборка.Следующий() Цикл 
								ОбластьСтрокаИтоги.Параметры.Заполнить(Выборка);  
								ТабДокумент.Вывести(ОбластьСтрокаИтоги, 3);    		
								
							КонецЦикла;
							
						Иначе	   
							
							Если ВыборкаВидОперации.ВидОперации = "" Тогда    
								Выборка  = ВыборкаВидОперации.Выбрать();          
							
								Пока Выборка.Следующий() Цикл 
									ОбластьСтрока.Параметры.Заполнить(Выборка);  
									ТабДокумент.Вывести(ОбластьСтрока, 3);    								
								КонецЦикла;    			
								
							Иначе								
								ОбластьВидОперации.Параметры.ВидОперации = ВыборкаВидОперации.ВидОперации;    
								ТабДокумент.Вывести(ОбластьВидОперации, 3);       						
									
								Выборка  = ВыборкаВидОперации.Выбрать();          
								
								Пока Выборка.Следующий() Цикл 
									ОбластьСтрока.Параметры.Заполнить(Выборка);  
									ТабДокумент.Вывести(ОбластьСтрока, 4);    								
								КонецЦикла;    							                                  
							КонецЕсли;
						КонецЕсли;		
					КонецЦикла;	 					
				КонецЦикла;   
			КонецЦикла;	  			
        КонецЦикла;



		
		
	КонецЕсли;
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат ТабДокумент;
	
КонецФункции
